app/controllers/items_controller.rb

  def index
    families = current_user.families
    item_ids = []
    families.each do |family|
      family.items.each do |item|
---
SELECT "items".* FROM "items"